of_cases/manifold_standard/0/k
FoamFile { format ascii; class volScalarField; object k; }
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.00375;
boundaryField
{
    inlet1 { type fixedValue; value uniform 0.00375; }
    inlet2 { type fixedValue; value uniform 0.00375; }
    inlet3 { type fixedValue; value uniform 0.00375; }
    outlet { type zeroGradient; }
    wall   { type kqRWallFunction; value uniform 0.00375; }
    frontAndBack { type empty; }
}
