of_cases/manifold_standard/0/nut
FoamFile { format ascii; class volScalarField; object nut; }
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet1 { type calculated; value uniform 0; }
    inlet2 { type calculated; value uniform 0; }
    inlet3 { type calculated; value uniform 0; }
    outlet { type calculated; value uniform 0; }
    wall   { type nutkWallFunction; value uniform 0; }
    frontAndBack { type empty; }
}
