of_cases/manifold_standard/0/p
FoamFile { format ascii; class volScalarField; object p; }
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet1 { type zeroGradient; }
    inlet2 { type zeroGradient; }
    inlet3 { type zeroGradient; }
    outlet { type fixedValue; value uniform 0; }
    wall   { type zeroGradient; }
    frontAndBack { type empty; }
}
