of_cases/manifold_standard/constant/momentumTransport
FoamFile { format ascii; class dictionary; location "constant"; object momentumTransport; }
simulationType  RAS;
RAS { model kEpsilon; turbulence on; printCoeffs on; }
