of_cases/manifold_standard/system/blockMeshDict
FoamFile { format ascii; class dictionary; object blockMeshDict; }

scale 1;

vertices
(
    // y=0 layer
    ( 0.00  0     0.00 )  //  0
    ( 0.02  0     0.00 )  //  1
    ( 0.05  0     0.00 )  //  2
    ( 0.07  0     0.00 )  //  3
    ( 0.10  0     0.00 )  //  4
    ( 0.12  0     0.00 )  //  5
    ( 0.15  0     0.00 )  //  6
    ( 0.21  0     0.00 )  //  7
    ( 0.00  0     0.03 )  //  8
    ( 0.02  0     0.03 )  //  9
    ( 0.05  0     0.03 )  // 10
    ( 0.07  0     0.03 )  // 11
    ( 0.10  0     0.03 )  // 12
    ( 0.12  0     0.03 )  // 13
    ( 0.15  0     0.03 )  // 14
    ( 0.21  0     0.03 )  // 15
    ( 0.02  0     0.12 )  // 16 inlet1 top-left
    ( 0.05  0     0.12 )  // 17 inlet1 top-right
    ( 0.07  0     0.12 )  // 18 inlet2 top-left
    ( 0.10  0     0.12 )  // 19 inlet2 top-right
    ( 0.12  0     0.12 )  // 20 inlet3 top-left
    ( 0.15  0     0.12 )  // 21 inlet3 top-right
    // y=0.01 layer
    ( 0.00  0.01  0.00 )  // 22
    ( 0.02  0.01  0.00 )  // 23
    ( 0.05  0.01  0.00 )  // 24
    ( 0.07  0.01  0.00 )  // 25
    ( 0.10  0.01  0.00 )  // 26
    ( 0.12  0.01  0.00 )  // 27
    ( 0.15  0.01  0.00 )  // 28
    ( 0.21  0.01  0.00 )  // 29
    ( 0.00  0.01  0.03 )  // 30
    ( 0.02  0.01  0.03 )  // 31
    ( 0.05  0.01  0.03 )  // 32
    ( 0.07  0.01  0.03 )  // 33
    ( 0.10  0.01  0.03 )  // 34
    ( 0.12  0.01  0.03 )  // 35
    ( 0.15  0.01  0.03 )  // 36
    ( 0.21  0.01  0.03 )  // 37
    ( 0.02  0.01  0.12 )  // 38
    ( 0.05  0.01  0.12 )  // 39
    ( 0.07  0.01  0.12 )  // 40
    ( 0.10  0.01  0.12 )  // 41
    ( 0.12  0.01  0.12 )  // 42
    ( 0.15  0.01  0.12 )  // 43
);

blocks
(
    // B0: header left cap  x=[0,0.02] z=[0,0.03]
    hex ( 0  1 23 22   8  9 31 30) ( 3 1  5) simpleGrading (1 1 1)
    // B1: header under inlet1  x=[0.02,0.05] z=[0,0.03]
    hex ( 1  2 24 23   9 10 32 31) ( 5 1  5) simpleGrading (1 1 1)
    // B2: header gap 1-2  x=[0.05,0.07] z=[0,0.03]
    hex ( 2  3 25 24  10 11 33 32) ( 3 1  5) simpleGrading (1 1 1)
    // B3: header under inlet2  x=[0.07,0.10] z=[0,0.03]
    hex ( 3  4 26 25  11 12 34 33) ( 5 1  5) simpleGrading (1 1 1)
    // B4: header gap 2-3  x=[0.10,0.12] z=[0,0.03]
    hex ( 4  5 27 26  12 13 35 34) ( 3 1  5) simpleGrading (1 1 1)
    // B5: header under inlet3  x=[0.12,0.15] z=[0,0.03]
    hex ( 5  6 28 27  13 14 36 35) ( 5 1  5) simpleGrading (1 1 1)
    // B6: outlet pipe  x=[0.15,0.21] z=[0,0.03]
    hex ( 6  7 29 28  14 15 37 36) (10 1  5) simpleGrading (1 1 1)
    // B7: inlet pipe 1  x=[0.02,0.05] z=[0.03,0.12]
    hex ( 9 10 32 31  16 17 39 38) ( 5 1 15) simpleGrading (1 1 1)
    // B8: inlet pipe 2  x=[0.07,0.10] z=[0.03,0.12]
    hex (11 12 34 33  18 19 41 40) ( 5 1 15) simpleGrading (1 1 1)
    // B9: inlet pipe 3  x=[0.12,0.15] z=[0.03,0.12]
    hex (13 14 36 35  20 21 43 42) ( 5 1 15) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet1 { type patch; faces ( (16 17 39 38) ); }
    inlet2 { type patch; faces ( (18 19 41 40) ); }
    inlet3 { type patch; faces ( (20 21 43 42) ); }

    outlet { type patch; faces ( (7 29 37 15) ); }

    wall
    {
        type wall;
        faces
        (
            // header bottom (z=0)
            (0 22 23 1)  (1 23 24 2)  (2 24 25 3)
            (3 25 26 4)  (4 26 27 5)  (5 27 28 6)  (6 28 29 7)
            // header left end (x=0)
            (0 8 30 22)
            // header top exposed (above left-cap, gaps, outlet-top)
            (8  9 31 30)   // B0 top
            (10 11 33 32)  // B2 gap top
            (12 13 35 34)  // B4 gap top
            (14 15 37 36)  // B6 outlet top
            // inlet pipe 1 sides
            ( 9 16 38 31)  // left  (-x)
            (10 32 39 17)  // right (+x)
            // inlet pipe 2 sides
            (11 18 40 33)  // left  (-x)
            (12 34 41 19)  // right (+x)
            // inlet pipe 3 sides
            (13 20 42 35)  // left  (-x)
            (14 36 43 21)  // right (+x)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            // y=0 faces
            ( 0  1  9  8)  ( 1  2 10  9)  ( 2  3 11 10)
            ( 3  4 12 11)  ( 4  5 13 12)  ( 5  6 14 13)  ( 6  7 15 14)
            ( 9 10 17 16)  (11 12 19 18)  (13 14 21 20)
            // y=0.01 faces
            (22 30 31 23)  (23 31 32 24)  (24 32 33 25)
            (25 33 34 26)  (26 34 35 27)  (27 35 36 28)  (28 36 37 29)
            (31 38 39 32)  (33 40 41 34)  (35 42 43 36)
        );
    }
);

mergePatchPairs ();
