of_cases/manifold_standard/system/controlDict
FoamFile { format ascii; class dictionary; object controlDict; }
solver          incompressibleFluid;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         500;
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      2;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
runTimeModifiable true;
