of_cases/manifold_standard/system/fvSolution
FoamFile { format ascii; class dictionary; object fvSolution; }
solvers
{
    p { solver GAMG; tolerance 1e-06; relTol 0.05; smoother GaussSeidel; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-06; relTol 0.1; }
    "(k|epsilon)"
    { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-06; relTol 0.1; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent yes;
    residualControl { p 1e-4; U 1e-4; "(k|epsilon)" 1e-4; }
}
relaxationFactors
{
    equations { U 0.7; k 0.5; epsilon 0.5; }
}
